//
//  EmojiMemoryGameViewModel.swift
//  Memorize
//
//  Created by Rupali Rajput on 06/01/23.
//

import Foundation

class EmojiMemoryGameViewModel {
    static let emojis = ["😂","😝","😁","😱","👉","🙌","🍻","🔥","🌈","☀","🎈","🌹","💄","🎀","⚽","🎾","🏁","😡","👿","🐻","🐶","🐬","🐟","🍀","👀","🚗","🍎","💝","💙","👌","❤","😍","😉","😓","😳","💪","💩","🍸","🔑","💖","🌟","🎉","🌺","🎶","👠","🏈","⚾","🏆","👽","💀","🐵","🐮","🐩","🐎","💣","👃","👂","🍓","💘","💜","👊","💋","😘","😜","😵","🙏","👋","🚽","💃","💎","🚀","🌙","🎁","⛄","🌊","⛵","🏀","🎱","💰","👶","👸","🐰","🐷","🐍","🐫","🔫","👄","🚲","🍉","💛","💚"]
    private var model = MemorizeGame<String>(numeberOfPairsOfCard: 4) { idx in emojis[idx] }
    
    func getCards() -> [MemorizeGame<String>.Card] {
        return model.cards
    }
    
}
